# aids.py

def main():
    # احتمال کلی ابتلا به بیماری:
    p_d = 64_000 / 80_827_001    # بنده خودم هم از آمار به این دقت پشمم ریخته خصوصا اون سه رقم آخرش!

    # احتمال کلی عدم ابتلا به بیماری:
    p_not_d = 1 - p_d
    
    # احتمال تست مثبت اگر مبتلا به بیماری:
    p_t_if_d = 0.99
    
    # احتمال تست مثبت ولی عدم ابتلا به بیماری:
    p_t_if_not_d = 1 - p_t_if_d
    
    # احتمال ابتلا به بیماری اگر تست مثبت ینی احتمال بدبخت شدن جو:
    p_d_if_t = (p_t_if_d * p_d) / ((p_t_if_d * p_d) + (p_t_if_not_d * p_not_d))
    
    # باید بگم کور خوندی، فرمول بالا درصد نمی‌ده و باید درصد رو حساب کنیم 🚬🚬
    print(f'Result is {int(p_d_if_t * 10000)/100}% accurate so,', 'he is very f**ked 😁' if (p_d_if_t >= 0.5) else 'meh, he is not so f**ked 😒')
if (__name__ == '__main__'):
    main()